app/controllers/event_participants_controller.rb

SELECT * FROM `members` INNER JOIN `events_members` ON `members`.id = `events_members`.member_id WHERE (`events_members`.event_id = 1 )
SELECT * FROM `teams` WHERE (`teams`.`id` = '1') LIMIT 1
---
  def find_or_new_team
    @teams = params[:user_id] ? Member.find( User.find(params[:id], :include => :member).member_id ).teams : [ Team.find_or_initialize_by_id(params[:team_id]) ]