app/controllers/events_controller.rb

SELECT * FROM `events` WHERE (`events`.`team_id` = '1')
SELECT * FROM `teams` WHERE (`teams`.`id` = 1)
---
  def index
    @events = Event.find_all_by_team_id(params[:team_id])
    @team = @events.first.team

SELECT * FROM `events` WHERE (`events`.`id` = 8)
---
  def show
    @event = Event.find(params[:id])

SELECT * FROM `events` WHERE (`events`.`id` = 1)
---
  def edit
    @event = Event.find(params[:id])

SELECT * FROM `events` WHERE (`events`.`id` = 8)
SELECT `event_participants`.* FROM `event_participants` WHERE (`event_participants`.event_id = 8)
SELECT * FROM `members` INNER JOIN `events_members` ON `members`.id = `events_members`.member_id WHERE (`events_members`.event_id = 1 AND (events_members.member_id NOT IN (10,8,9,1,6,7)))
SELECT * FROM `event_participant_atts` WHERE (`event_participant_atts`.event_participant_id = 354)
---
  def schedule
    @event = Event.find( params[:id], :include => :event_participants )

    template = @event.event_participants.length < 1 ? 'schedule_new' : 'schedule_edit'

    scheduled_members = @event.event_participants.collect{ |x| x.member_id }
    @members = []
    if scheduled_members.length > 0
      @members = @event.members.find( :all, :conditions => [ "events_members.member_id NOT IN (#{scheduled_members.join(',')})"] )
    else
      @members = @event.members
    end
    unscheduled_members = @event.member_ids - scheduled_members
    @members.length.times{ @event.event_participants.build( :member_id => unscheduled_members.shift, :event_participant_atts => [ EventParticipantAtt.new( :name => 'court_no' ) ] ) }

SELECT * FROM `events` WHERE (`events`.`id` = 8)
SELECT * FROM `teams` WHERE (`teams`.`id` = 1)
---
  def create_schedule
    event = Event.find(params[:id])
    event.update_attributes(params[:event])

    respond_to do |format|
      if event.save
        flash[:notice] = 'Event schedule was successfully created.'
        format.html { redirect_to( team_events_path( Team.find( event.team_id ) ) ) }

SELECT * FROM `events` WHERE (`events`.`id` = 2)
SELECT * FROM `teams` WHERE (`teams`.`id` = 1)
---
  def update_schedule
    event = Event.find(params[:id])
    event.update_attributes(params[:event])

    respond_to do |format|
      if event.save
        flash[:notice] = 'Schedule was successfully updated.'
        format.html { redirect_to( team_events_path( Team.find(event.team_id) ) ) }