app/controllers/teams_controller.rb

  def index
    @teams = Team.all
---
SELECT * FROM `teams`

  def show
    @team = Team.find(params[:id])
---
SELECT * FROM `teams` WHERE (`teams`.`id` = 0)