app/controllers/users_controller.rb

  def index
    @users = User.find_with_team_id( @team.id )
    @events = Event.find_all_by_team_id( @team.id )
---
SELECT * FROM `events` WHERE (`events`.`team_id` = 1)

  def show
    @user = User.find(params[:id], :include => :member)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT `members`.* FROM `members` WHERE (`members`.user_id = 1)

  def edit
    @user = User.find(params[:id])
    @teams = Team.all
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `teams`

  def update
    @user = User.find(params[:id])
    @member = Member.find(@user.member.id)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `members` WHERE (`members`.user_id = 1) LIMIT 1

  def edit_event_availability
    @user = User.find(params[:id], :include => :member)
---
SELECT * FROM `users` WHERE (`users`.`id` = 6)
SELECT `members`.* FROM `members` WHERE (`members`.user_id = 6)

  def find_or_new_team
    @team = params[:team_id] ? Team.find(params[:team_id]) : Team.new()
---
SELECT * FROM `teams` WHERE (`teams`.`id` IN (1,2))